## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.acr.azurerm_redis_cache.redis_prod will be updated in-place
  ~ resource "azurerm_redis_cache" "redis_prod" {
      ~ enable_non_ssl_port           = true -> false
        id                            = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Cache/redis/fp11redisprod"
        name                          = "fp11redisprod"
        tags                          = {}
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acr.azurerm_redis_cache.redis_test will be updated in-place
  ~ resource "azurerm_redis_cache" "redis_test" {
      ~ enable_non_ssl_port           = true -> false
        id                            = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Cache/redis/fp11redistest"
        name                          = "fp11redistest"
        tags                          = {}
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.prod will be created
  + resource "azurerm_kubernetes_cluster" "prod" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "fp11-aks-prod-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32.0"
      + location                            = "canadacentral"
      + name                                = "fp11-aks-prod"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cst8918-final-project-group-11"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "prod"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile {
          + authorized_ip_ranges = [
              + "0.0.0.0/0",
            ]
        }

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = (known after apply)
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Network/virtualNetworks/fp11-vnet/subnets/prod"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip          = "10.241.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.241.0.0/16"
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.test must be replaced
-/+ resource "azurerm_kubernetes_cluster" "test" {
      ~ api_server_authorized_ip_ranges     = [
          - "0.0.0.0/0",
        ] -> (known after apply)
      - cost_analysis_enabled               = false -> null
      ~ current_kubernetes_version          = "1.32.0" -> (known after apply)
      - custom_ca_trust_certificates_base64 = [] -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "fp11-aks-test-dns-yquf2z23.hcp.canadacentral.azmk8s.io" -> (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.ContainerService/managedClusters/fp11-aks-test" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      - local_account_disabled              = false -> null
        name                                = "fp11-aks-test"
      ~ node_resource_group                 = "MC_cst8918-final-project-group-11_fp11-aks-test_canadacentral" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/MC_cst8918-final-project-group-11_fp11-aks-test_canadacentral" -> (known after apply)
      - oidc_issuer_enabled                 = false -> null
      + oidc_issuer_url                     = (known after apply)
      ~ portal_fqdn                         = "fp11-aks-test-dns-yquf2z23.portal.hcp.canadacentral.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
        tags                                = {
            "environment" = "test"
        }
        # (18 unchanged attributes hidden)

      ~ api_server_access_profile {
          - vnet_integration_enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ auto_scaler_profile (known after apply)

      ~ default_node_pool {
          - custom_ca_trust_enabled       = false -> null
          - enable_auto_scaling           = false -> null
          - enable_host_encryption        = false -> null
          - enable_node_public_ip         = false -> null
          - fips_enabled                  = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
          - max_count                     = 0 -> null
          ~ max_pods                      = 30 -> (known after apply)
          - min_count                     = 0 -> null
            name                          = "default"
          ~ node_labels                   = {} -> (known after apply)
          - node_taints                   = [] -> null
          - only_critical_addons_enabled  = false -> null
          ~ orchestrator_version          = "1.32.0" -> (known after apply)
          ~ os_disk_size_gb               = 128 -> (known after apply)
          ~ os_sku                        = "Ubuntu" -> (known after apply)
          - tags                          = {} -> null
          + workload_runtime              = (known after apply)
          - zones                         = [] -> null
            # (16 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "99fc0e5c-3d5c-4867-88ff-609f5d8d168f" -> (known after apply)
          ~ tenant_id    = "e39de75c-b796-4bdd-888d-f3d21250910c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ kubelet_identity (known after apply)
      - kubelet_identity {
          - client_id                 = "e2719236-3cfb-4dee-89de-8f16207f9dd5" -> null
          - object_id                 = "e9a69946-4470-40da-a92e-ac7cdcb0183c" -> null
          - user_assigned_identity_id = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/MC_cst8918-final-project-group-11_fp11-aks-test_canadacentral/providers/Microsoft.ManagedIdentity/userAssignedIdentities/fp11-aks-test-agentpool" -> null
        }

      ~ network_profile {
          ~ dns_service_ip          = "10.0.0.10" -> "10.240.0.10" # forces replacement
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          ~ ip_versions             = [
              - "IPv4",
            ] -> (known after apply)
          ~ network_data_plane      = "azure" -> (known after apply)
          + network_mode            = (known after apply)
          ~ outbound_ip_address_ids = [] -> (known after apply)
          ~ outbound_ip_prefix_ids  = [] -> (known after apply)
          + pod_cidr                = (known after apply)
          ~ pod_cidrs               = [] -> (known after apply)
          ~ service_cidr            = "10.0.0.0/16" -> "10.240.0.0/16" # forces replacement
          ~ service_cidrs           = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (5 unchanged attributes hidden)

          ~ load_balancer_profile (known after apply)
          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/MC_cst8918-final-project-group-11_fp11-aks-test_canadacentral/providers/Microsoft.Network/publicIPAddresses/e9a25371-691d-4208-ab56-71624fc4d821",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }

          ~ nat_gateway_profile (known after apply)
        }

      ~ windows_profile (known after apply)
      - windows_profile {
          - admin_username = "azureuser" -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>